garyPenhook/PyAvrOCD/svd/atmega644rfr2.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EEPROM</name>
      <description>EEPROM</description>
      <baseAddress>0x0080003F</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EEAR</name>
          <description>EEPROM Address Register  Bytes</description>
          <addressOffset>0x2</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>EECR</name>
          <description>EEPROM Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EERE</name>
              <description>EEPROM Read Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEPE</name>
              <description>EEPROM Programming Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEMPE</name>
              <description>EEPROM Master Write Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EERIE</name>
              <description>EEPROM Ready Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EEPM</name>
              <description>EEPROM Programming Mode</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERASE_AND_WRITE_IN_ONE_OPERATION_ATOMIC_OPERATION</name>
                  <description>Erase and Write in one operation (Atomic Operation)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERASE_ONLY</name>
                  <description>Erase only</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_ONLY</name>
                  <description>Write only</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED_FOR_FUTURE_USE</name>
                  <description>Reserved for future use</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EEDR</name>
          <description>EEPROM Data Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EXINT</name>
      <description>External Interrupts</description>
      <baseAddress>0x0080003B</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2D</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EICRA</name>
          <description>External Interrupt Control Register A</description>
          <addressOffset>0x2E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC0</name>
              <description>External Interrupt 0 Sense Control Bit</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THE_LOW_LEVEL_OF_INTN_GENERATES_AN_INTERRUPT_REQUEST</name>
                  <description>The low level of INTn generates an interrupt request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>Any edge of INTn generates asynchronously an interrupt request.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THE_FALLING_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>The falling edge of INTn generates asynchronously an interrupt request.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THE_RISING_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>The rising edge of INTn generates asynchronously an interrupt request.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC1</name>
              <description>External Interrupt 1 Sense Control Bit</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THE_LOW_LEVEL_OF_INTN_GENERATES_AN_INTERRUPT_REQUEST</name>
                  <description>The low level of INTn generates an interrupt request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>Any edge of INTn generates asynchronously an interrupt request.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THE_FALLING_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>The falling edge of INTn generates asynchronously an interrupt request.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THE_RISING_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>The rising edge of INTn generates asynchronously an interrupt request.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC2</name>
              <description>External Interrupt 2 Sense Control Bit</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THE_LOW_LEVEL_OF_INTN_GENERATES_AN_INTERRUPT_REQUEST</name>
                  <description>The low level of INTn generates an interrupt request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>Any edge of INTn generates asynchronously an interrupt request.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THE_FALLING_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>The falling edge of INTn generates asynchronously an interrupt request.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THE_RISING_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>The rising edge of INTn generates asynchronously an interrupt request.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC3</name>
              <description>External Interrupt 3 Sense Control Bit</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THE_LOW_LEVEL_OF_INTN_GENERATES_AN_INTERRUPT_REQUEST</name>
                  <description>The low level of INTn generates an interrupt request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>Any edge of INTn generates asynchronously an interrupt request.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THE_FALLING_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>The falling edge of INTn generates asynchronously an interrupt request.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THE_RISING_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>The rising edge of INTn generates asynchronously an interrupt request.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EICRB</name>
          <description>External Interrupt Control Register B</description>
          <addressOffset>0x2F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC4</name>
              <description>External Interrupt 4 Sense Control Bit</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THE_LOW_LEVEL_OF_INTN_GENERATES_AN_INTERRUPT_REQUEST</name>
                  <description>The low level of INTn generates an interrupt request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>Any edge of INTn generates asynchronously an interrupt request.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THE_FALLING_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>The falling edge of INTn generates asynchronously an interrupt request.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THE_RISING_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>The rising edge of INTn generates asynchronously an interrupt request.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC5</name>
              <description>External Interrupt 5 Sense Control Bit</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THE_LOW_LEVEL_OF_INTN_GENERATES_AN_INTERRUPT_REQUEST</name>
                  <description>The low level of INTn generates an interrupt request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>Any edge of INTn generates asynchronously an interrupt request.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THE_FALLING_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>The falling edge of INTn generates asynchronously an interrupt request.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THE_RISING_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>The rising edge of INTn generates asynchronously an interrupt request.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC6</name>
              <description>External Interrupt 6 Sense Control Bit</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THE_LOW_LEVEL_OF_INTN_GENERATES_AN_INTERRUPT_REQUEST</name>
                  <description>The low level of INTn generates an interrupt request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>Any edge of INTn generates asynchronously an interrupt request.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THE_FALLING_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>The falling edge of INTn generates asynchronously an interrupt request.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THE_RISING_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>The rising edge of INTn generates asynchronously an interrupt request.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC7</name>
              <description>External Interrupt 7 Sense Control Bit</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THE_LOW_LEVEL_OF_INTN_GENERATES_AN_INTERRUPT_REQUEST</name>
                  <description>The low level of INTn generates an interrupt request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANY_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>Any edge of INTn generates asynchronously an interrupt request.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THE_FALLING_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>The falling edge of INTn generates asynchronously an interrupt request.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THE_RISING_EDGE_OF_INTN_GENERATES_ASYNCHRONOUSLY_AN_INTERRUPT_REQUEST</name>
                  <description>The rising edge of INTn generates asynchronously an interrupt request.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EIFR</name>
          <description>External Interrupt Flag Register (read-only for debugger)</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INTF</name>
              <description>External Interrupt Flag</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EDGE_OR_LOGIC_CHANGE_ON_INT7_0_OCCURRED</name>
                  <description>No edge or logic change on INT7:0 occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_EDGE_OR_LOGIC_CHANGE_ON_INT0_OCCURRED_AND_TRIGGERED_AN_INTERRUPT_REQUEST</name>
                  <description>A edge or logic change on INT0 occurred and triggered an interrupt request.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>...</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_EDGE_OR_LOGIC_CHANGE_ON_INT7_OCCURRED_AND_TRIGGERED_AN_INTERRUPT_REQUEST</name>
                  <description>A edge or logic change on INT7 occurred and triggered an interrupt request.</description>
                  <value>128</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EIMSK</name>
          <description>External Interrupt Mask Register</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT</name>
              <description>External Interrupt Request Enable</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALL_EXTERNAL_PIN_INTERRUPTS_ARE_DISABLED</name>
                  <description>All external pin interrupts are disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_EXTERNAL_PIN_INTERRUPTS_ARE_ENABLED</name>
                  <description>All external pin interrupts are enabled.</description>
                  <value>255</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCICR</name>
          <description>Pin Change Interrupt Control Register</description>
          <addressOffset>0x2D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCIE</name>
              <description>Pin Change Interrupt Enables</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>Res</name>
              <description>Reserved Bit</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PCIFR</name>
          <description>Pin Change Interrupt Flag Register (read-only for debugger)</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCIF</name>
              <description>Pin Change Interrupt Flags</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>Res</name>
              <description>Reserved Bit</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
