garyPenhook/PyAvrOCD/svd/atmega644rfr2.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TC3</name>
      <description>Timer/Counter, 16-bit</description>
      <baseAddress>0x00800038</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x39</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x58</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x5C</offset>
        <size>0xA</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ICR3</name>
          <description>Timer/Counter3 Input Capture Register  Bytes</description>
          <addressOffset>0x5E</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR3A</name>
          <description>Timer/Counter3 Output Compare Register A  Bytes</description>
          <addressOffset>0x60</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR3B</name>
          <description>Timer/Counter3 Output Compare Register B  Bytes</description>
          <addressOffset>0x62</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR3C</name>
          <description>Timer/Counter3 Output Compare Register C  Bytes</description>
          <addressOffset>0x64</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TCCR3A</name>
          <description>Timer/Counter3 Control Register A</description>
          <addressOffset>0x58</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WGM3</name>
              <description>Waveform Generation Mode</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_MODE_OF_OPERATION</name>
                  <description>Normal mode of operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_PHASE_CORRECT_8_BIT</name>
                  <description>PWM, phase correct, 8-bit</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_PHASE_CORRECT_9_BIT</name>
                  <description>PWM, phase correct, 9-bit</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_PHASE_CORRECT_10_BIT</name>
                  <description>PWM, phase correct, 10-bit</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COM3C</name>
              <description>Compare Output Mode for Channel C</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_PORT_OPERATION_OCNA_OCNB_OCNC_DISCONNECTED</name>
                  <description>Normal port operation, OCnA/OCnB/OCnC disconnected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLE_OCNA_OCNB_OCNC_ON_COMPARE_MATCH</name>
                  <description>Toggle OCnA/OCnB/OCnC on Compare Match.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_OCNA_OCNB_OCNC_ON_COMPARE_MATCH_SET_OUTPUT_TO_LOW_LEVEL</name>
                  <description>Clear OCnA/OCnB/OCnC on Compare Match (set output to low level).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_OCNA_OCNB_OCNC_ON_COMPARE_MATCH_SET_OUTPUT_TO_HIGH_LEVEL</name>
                  <description>Set OCnA/OCnB/OCnC on Compare Match (set output to high level).</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COM3B</name>
              <description>Compare Output Mode for Channel B</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_PORT_OPERATION_OCNA_OCNB_OCNC_DISCONNECTED</name>
                  <description>Normal port operation, OCnA/OCnB/OCnC disconnected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLE_OCNA_OCNB_OCNC_ON_COMPARE_MATCH</name>
                  <description>Toggle OCnA/OCnB/OCnC on Compare Match.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_OCNA_OCNB_OCNC_ON_COMPARE_MATCH_SET_OUTPUT_TO_LOW_LEVEL</name>
                  <description>Clear OCnA/OCnB/OCnC on Compare Match (set output to low level).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_OCNA_OCNB_OCNC_ON_COMPARE_MATCH_SET_OUTPUT_TO_HIGH_LEVEL</name>
                  <description>Set OCnA/OCnB/OCnC on Compare Match (set output to high level).</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COM3A</name>
              <description>Compare Output Mode for Channel A</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_PORT_OPERATION_OCNA_OCNB_OCNC_DISCONNECTED</name>
                  <description>Normal port operation, OCnA/OCnB/OCnC disconnected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOGGLE_OCNA_OCNB_OCNC_ON_COMPARE_MATCH</name>
                  <description>Toggle OCnA/OCnB/OCnC on Compare Match.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_OCNA_OCNB_OCNC_ON_COMPARE_MATCH_SET_OUTPUT_TO_LOW_LEVEL</name>
                  <description>Clear OCnA/OCnB/OCnC on Compare Match (set output to low level).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_OCNA_OCNB_OCNC_ON_COMPARE_MATCH_SET_OUTPUT_TO_HIGH_LEVEL</name>
                  <description>Set OCnA/OCnB/OCnC on Compare Match (set output to high level).</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR3B</name>
          <description>Timer/Counter3 Control Register B</description>
          <addressOffset>0x59</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CS3</name>
              <description>Clock Select</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CLOCK_SOURCE_TIMER_COUNTER_STOPPED</name>
                  <description>No clock source (Timer/Counter stopped)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_IO_1_NO_PRESCALING</name>
                  <description>clk_IO/1 (no prescaling)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_IO_8_FROM_PRESCALER</name>
                  <description>clk_IO/8 (from prescaler)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_IO_64_FROM_PRESCALER</name>
                  <description>clk_IO/64 (from prescaler)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_IO_256_FROM_PRESCALER</name>
                  <description>clk_IO/256 (from prescaler)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_IO_1024_FROM_PRESCALER</name>
                  <description>clk_IO/1024 (from prescaler)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTERNAL_CLOCK_SOURCE_ON_TN_PIN_CLOCK_ON_FALLING_EDGE</name>
                  <description>External clock source on Tn pin, clock on falling edge</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTERNAL_CLOCK_SOURCE_ON_TN_PIN_CLOCK_ON_RISING_EDGE</name>
                  <description>External clock source on Tn pin, clock on rising edge</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WGM3</name>
              <description>Waveform Generation Mode</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_MODE_OF_OPERATION</name>
                  <description>Normal mode of operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_PHASE_CORRECT_8_BIT</name>
                  <description>PWM, phase correct, 8-bit</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_PHASE_CORRECT_9_BIT</name>
                  <description>PWM, phase correct, 9-bit</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_PHASE_CORRECT_10_BIT</name>
                  <description>PWM, phase correct, 10-bit</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Res</name>
              <description>Reserved Bit</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICES3</name>
              <description>Input Capture 3 Edge Select</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICNC3</name>
              <description>Input Capture 3 Noise Canceller</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR3C</name>
          <description>Timer/Counter3 Control Register C</description>
          <addressOffset>0x5A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FOC3C</name>
              <description>Force Output Compare for Channel C</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FOC3B</name>
              <description>Force Output Compare for Channel B</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FOC3A</name>
              <description>Force Output Compare for Channel A</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCNT3</name>
          <description>Timer/Counter3  Bytes</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TIFR3</name>
          <description>Timer/Counter3 Interrupt Flag Register (read-only for debugger)</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOV3</name>
              <description>Timer/Counter3 Overflow Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCF3A</name>
              <description>Timer/Counter3 Output Compare A Match Flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCF3B</name>
              <description>Timer/Counter3 Output Compare B Match Flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCF3C</name>
              <description>Timer/Counter3 Output Compare C Match Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICF3</name>
              <description>Timer/Counter3 Input Capture Flag</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSK3</name>
          <description>Timer/Counter3 Interrupt Mask Register</description>
          <addressOffset>0x39</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOIE3</name>
              <description>Timer/Counter3 Overflow Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCIE3A</name>
              <description>Timer/Counter3 Output Compare A Match Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCIE3B</name>
              <description>Timer/Counter3 Output Compare B Match Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCIE3C</name>
              <description>Timer/Counter3 Output Compare C Match Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICIE3</name>
              <description>Timer/Counter3 Input Capture Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
